
WHITELIST = ["등급", "학수번호", "학기", "과목명", "평점평균", "취득학점"]
SAFE_KEYWORDS = [
    # 제목 및 인적사항 관련
    "학", "생", "인", "적", "사", "항", "개인별", "전체", "성적", "조회", "성적표",
    "학번", "성명", "소속", "대학", "전공", "학과", "학부", "학년", "상태",

    # 헤더 및 성적 항목
    "년도", "학기", "이수구분", "학수번호", "과목명", "학점", "등급", "평점", "인정구분", "삭제구분",
    "취득학점", "평점평균", "신청학점", "교양", "전선", "전필", "일선", "기초", "지필",

    # 학기 및 성적 값
    "1학기", "2학기", "여름학기", "겨울학기", "계절학기", "A+", "A0", "B+", "B0", "C+", "C0", "D+", "D0", "F", "P", "NP",
    "합계", "평균", "총계", "이수", "미이수", "재이수", "대상", "Pass", "Fail"
]
