import pandas as pd              # 1. 데이터를 표(DataFrame) 형태로 다루기 위해
from openpyxl.utils import get_column_letter  # 4. 숫자(1)를 엑셀 열(A)로 바꾸기 위해


def get_excel_data_optimized(file_path):
    df = pd.read_excel(file_path, engine='openpyxl', header=None)
    # header=None: 엑셀의 1행도 그냥 데이터로
    # if) option 지정 하지 않으면 엑셀의 첫 번째 줄(1행)을 자동으로 제목으로 인식
    # so, 지정을 해줘야 pandas index 0번이 엑셀 1행과 일치하게 되어, 좌표 계산(+1)이 정확해짐.

    total_rows, total_cols = df.shape
    print(f"{total_rows} rows and {total_cols} columns")

    # [행, 열]
    # if 2행부터 5행 df.iloc[1:5, :] (index start 0 , slicing rule [a:b]== a~b-1)
    subset = df.iloc[2:3, :]


    # 3. stack()으로 유효 데이터 좌표 추출 (이중 반복문 대체)
    # dropna()를 붙여주면 결측치를 더 확실히 제거합니다.
    stacked = subset.stack().dropna()

    print(f"--- iloc 슬라이싱 추출 결과 ---")



    for (row_idx, col_idx), value in stacked.items():
        val_str = str(value).strip()

        # 의미 없는 값 None 치환
        if val_str and "Unnamed" not in val_str and val_str.lower() != "None" and val_str.lower() != "Nan":
            excel_row = row_idx + 1
            excel_col_letter = get_column_letter(col_idx + 1) # index는 start 0부터 이므로 +1을 해줘야 함 (시작은 1행 1열이므로)
            print(f"[{excel_col_letter}:{excel_row}], [index 열:{col_idx} | 행:{row_idx}]: '{val_str}'")

# 실행
raw_path = "data/raw/noname.xlsx"
get_excel_data_optimized(raw_path)

# === Title ===
# subset = df.iloc[1:2, :]
# 82 rows and 34 columns
# --- iloc 슬라이싱 추출 결과 ---
# [B:2]: 학 생 인 적 사 항

# === Info (1) ===
# subset = df.iloc[2:3, :]
# 82 rows and 34 columns
# --- iloc 슬라이싱 추출 결과 ---
# [B:3]: 학 번
# [D:3]: 202121158
# [H:3]: 성 명
# [K:3]: 황윤정
# [P:3]: 학적상태
# [Q:3]: 재학생
# [S:3]: 학생구분
# [X:3]: 일반
# [AB:3]: 학년
# [AC:3]: 4.0
# [AF:3]: 교직여부
# [AH:3]: N

# === Header (1)  ===
# subset = df.iloc[5:6, :]
# --- iloc 슬라이싱 추출 결과 ---
# [B:6]: 개인별 전체 성적조회

# === Header (2) ===
# subset = df.iloc[6:7, :]
# 82 rows and 34 columns
# --- iloc 슬라이싱 추출 결과 ---
# [B:7], [index 열:1 | 행:6]: 년도
# [C:7], [index 열:2 | 행:6]: 학기
# [E:7], [index 열:4 | 행:6]: 이수구분
# [G:7], [index 열:6 | 행:6]: 학수번호
# [L:7], [index 열:11 | 행:6]: 과목명
# [W:7], [index 열:22 | 행:6]: 학점
# [Y:7], [index 열:24 | 행:6]: 등급
# [AA:7], [index 열:26 | 행:6]: 인정구분
# [AG:7], [index 열:32 | 행:6]: 삭제구분

# 과목 추출 열 index [1,2,4,6,11,22,24,26,32]열의 행 추출
# 상단 헤더 하단 부분 모두 출력이므로 행 index는 7:

# === Lecture ===
# subset = df.iloc[7:, [1,2,4,6,11,22,24,26,32]]
# 82 rows and 34 columns
# --- iloc 슬라이싱 추출 결과 ---
# [B:8], [index 열:1 | 행:7]: 2021
# [C:8], [index 열:2 | 행:7]: 1학기
# [E:8], [index 열:4 | 행:7]: 일선
# [G:8], [index 열:6 | 행:7]: BVBA63423
# [L:8], [index 열:11 | 행:7]: 바이오메디컬공학개론
# [W:8], [index 열:22 | 행:7]: 3
# [Y:8], [index 열:24 | 행:7]: D
# [AG:8], [index 열:32 | 행:7]: 취득학점포기
# [B:9], [index 열:1 | 행:8]: 2021
# [C:9], [index 열:2 | 행:8]: 1학기
# [E:9], [index 열:4 | 행:8]: 기초
# [G:9], [index 열:6 | 행:8]: BKSA49491
# [L:9], [index 열:11 | 행:8]: 글쓰기
# [W:9], [index 열:22 | 행:8]: 3
# [Y:9], [index 열:24 | 행:8]: F
# [AG:9], [index 열:32 | 행:8]: 취득학점포기
# [B:10], [index 열:1 | 행:9]: 2021
# [C:10], [index 열:2 | 행:9]: 1학기
# [E:10], [index 열:4 | 행:9]: 기초
# [G:10], [index 열:6 | 행:9]: BKSA58133
# [L:10], [index 열:11 | 행:9]: 대학기초물리학
# [W:10], [index 열:22 | 행:9]: 3
# [Y:10], [index 열:24 | 행:9]: F
# [AG:10], [index 열:32 | 행:9]: 취득학점포기
# [B:11], [index 열:1 | 행:10]: 2021
# [C:11], [index 열:2 | 행:10]: 1학기
# [E:11], [index 열:4 | 행:10]: 심화
# [G:11], [index 열:6 | 행:10]: BKSA58187
# [L:11], [index 열:11 | 행:10]: 생태환경의이해
# [W:11], [index 열:22 | 행:10]: 2
# [Y:11], [index 열:24 | 행:10]: F
# [AG:11], [index 열:32 | 행:10]: 취득학점포기
# [B:12], [index 열:1 | 행:11]: 2021
# [C:12], [index 열:2 | 행:11]: 1학기
# [E:12], [index 열:4 | 행:11]: 심화
# [G:12], [index 열:6 | 행:11]: BKSA59502
# [L:12], [index 열:11 | 행:11]: 환경과에너지
# [W:12], [index 열:22 | 행:11]: 2
# [Y:12], [index 열:24 | 행:11]: F
# [AG:12], [index 열:32 | 행:11]: 취득학점포기
# [B:14], [index 열:1 | 행:13]: 2022
# [C:14], [index 열:2 | 행:13]: 1학기
# [E:14], [index 열:4 | 행:13]: 기초
# [G:14], [index 열:6 | 행:13]: BKSA53699
# [L:14], [index 열:11 | 행:13]: KUGEP1
# [W:14], [index 열:22 | 행:13]: 3
# [Y:14], [index 열:24 | 행:13]: A+
# [B:15], [index 열:1 | 행:14]: 2022
# [C:15], [index 열:2 | 행:14]: 1학기
# [E:15], [index 열:4 | 행:14]: 기초
# [G:15], [index 열:6 | 행:14]: BKSA15891
# [L:15], [index 열:11 | 행:14]: 대학기초수학
# [W:15], [index 열:22 | 행:14]: 3
# [Y:15], [index 열:24 | 행:14]: B
# [B:16], [index 열:1 | 행:15]: 2022
# [C:16], [index 열:2 | 행:15]: 1학기
# [E:16], [index 열:4 | 행:15]: 기초
# [G:16], [index 열:6 | 행:15]: BKSA64611
# [L:16], [index 열:11 | 행:15]: 창의글쓰기
# [W:16], [index 열:22 | 행:15]: 3
# [Y:16], [index 열:24 | 행:15]: B+
# [B:17], [index 열:1 | 행:16]: 2022
# [C:17], [index 열:2 | 행:16]: 1학기
# [E:17], [index 열:4 | 행:16]: 기초
# [G:17], [index 열:6 | 행:16]: BKSA58113
# [L:17], [index 열:11 | 행:16]: 철학의고전
# [W:17], [index 열:22 | 행:16]: 3
# [Y:17], [index 열:24 | 행:16]: A+
# [B:18], [index 열:1 | 행:17]: 2022
# [C:18], [index 열:2 | 행:17]: 1학기
# [E:18], [index 열:4 | 행:17]: 심화
# [G:18], [index 열:6 | 행:17]: BKSA59497
# [L:18], [index 열:11 | 행:17]: 기후변화개론
# [W:18], [index 열:22 | 행:17]: 2
# [Y:18], [index 열:24 | 행:17]: B+
# [B:19], [index 열:1 | 행:18]: 2022
# [C:19], [index 열:2 | 행:18]: 1학기
# [E:19], [index 열:4 | 행:18]: 심화
# [G:19], [index 열:6 | 행:18]: BKSA53992
# [L:19], [index 열:11 | 행:18]: 성인을위한평생학습
# [W:19], [index 열:22 | 행:18]: 2
# [Y:19], [index 열:24 | 행:18]: A
# [B:21], [index 열:1 | 행:20]: 2023
# [C:21], [index 열:2 | 행:20]: 1학기
# [E:21], [index 열:4 | 행:20]: 일선
# [G:21], [index 열:6 | 행:20]: BVBA59572
# [L:21], [index 열:11 | 행:20]: 의공학기반해부생리학
# [W:21], [index 열:22 | 행:20]: 3
# [Y:21], [index 열:24 | 행:20]: C
# [B:22], [index 열:1 | 행:21]: 2023
# [C:22], [index 열:2 | 행:21]: 1학기
# [E:22], [index 열:4 | 행:21]: 일선
# [G:22], [index 열:6 | 행:21]: BVBA15337
# [L:22], [index 열:11 | 행:21]: 통계학
# [W:22], [index 열:22 | 행:21]: 3
# [Y:22], [index 열:24 | 행:21]: C
# [B:23], [index 열:1 | 행:22]: 2023
# [C:23], [index 열:2 | 행:22]: 1학기
# [E:23], [index 열:4 | 행:22]: 일선
# [G:23], [index 열:6 | 행:22]: BVBA15887
# [L:23], [index 열:11 | 행:22]: 회로이론1
# [W:23], [index 열:22 | 행:22]: 3
# [Y:23], [index 열:24 | 행:22]: D
# [AG:23], [index 열:32 | 행:22]: 취득학점포기
# [B:24], [index 열:1 | 행:23]: 2023
# [C:24], [index 열:2 | 행:23]: 1학기
# [E:24], [index 열:4 | 행:23]: 인성
# [G:24], [index 열:6 | 행:23]: BZZA62440
# [L:24], [index 열:11 | 행:23]: 성신의대학생활지도
# [W:24], [index 열:22 | 행:23]: 1
# [Y:24], [index 열:24 | 행:23]: P
# [B:25], [index 열:1 | 행:24]: 2023
# [C:25], [index 열:2 | 행:24]: 1학기
# [E:25], [index 열:4 | 행:24]: 심화
# [G:25], [index 열:6 | 행:24]: BKSA11067
# [L:25], [index 열:11 | 행:24]: 미학개론
# [W:25], [index 열:22 | 행:24]: 2
# [Y:25], [index 열:24 | 행:24]: B+
# [B:26], [index 열:1 | 행:25]: 2023
# [C:26], [index 열:2 | 행:25]: 1학기
# [E:26], [index 열:4 | 행:25]: 심화
# [G:26], [index 열:6 | 행:25]: BKSA59500
# [L:26], [index 열:11 | 행:25]: 빅데이터활용
# [W:26], [index 열:22 | 행:25]: 2
# [Y:26], [index 열:24 | 행:25]: C+
# [B:27], [index 열:1 | 행:26]: 2023
# [C:27], [index 열:2 | 행:26]: 1학기
# [E:27], [index 열:4 | 행:26]: 심화
# [G:27], [index 열:6 | 행:26]: BKSA55245
# [L:27], [index 열:11 | 행:26]: 재미있는인간관계의심리학
# [W:27], [index 열:22 | 행:26]: 2
# [Y:27], [index 열:24 | 행:26]: C+
# [B:28], [index 열:1 | 행:27]: 2023
# [C:28], [index 열:2 | 행:27]: 1학기
# [E:28], [index 열:4 | 행:27]: 소양
# [G:28], [index 열:6 | 행:27]: BKSA58114
# [L:28], [index 열:11 | 행:27]: MOS
# [W:28], [index 열:22 | 행:27]: 2
# [Y:28], [index 열:24 | 행:27]: N
# [AG:28], [index 열:32 | 행:27]: 취득학점포기
# [B:30], [index 열:1 | 행:29]: 2023
# [C:30], [index 열:2 | 행:29]: 하계 계절학기
# [E:30], [index 열:4 | 행:29]: 기초
# [G:30], [index 열:6 | 행:29]: BKSA39798
# [L:30], [index 열:11 | 행:29]: 비판적사고와토론
# [W:30], [index 열:22 | 행:29]: 3
# [Y:30], [index 열:24 | 행:29]: C+
# [B:31], [index 열:1 | 행:30]: 2023
# [C:31], [index 열:2 | 행:30]: 하계 계절학기
# [E:31], [index 열:4 | 행:30]: 심화
# [G:31], [index 열:6 | 행:30]: BKSA51421
# [L:31], [index 열:11 | 행:30]: 토익1
# [W:31], [index 열:22 | 행:30]: 2
# [Y:31], [index 열:24 | 행:30]: D+
# [AG:31], [index 열:32 | 행:30]: 취득학점포기
# [B:33], [index 열:1 | 행:32]: 2023
# [C:33], [index 열:2 | 행:32]: 2학기
# [E:33], [index 열:4 | 행:32]: 일선
# [G:33], [index 열:6 | 행:32]: BVBA07678
# [L:33], [index 열:11 | 행:32]: 공학수학
# [W:33], [index 열:22 | 행:32]: 3
# [Y:33], [index 열:24 | 행:32]: D+
# [B:34], [index 열:1 | 행:33]: 2023
# [C:34], [index 열:2 | 행:33]: 2학기
# [E:34], [index 열:4 | 행:33]: 일선
# [G:34], [index 열:6 | 행:33]: BVBA15812
# [L:34], [index 열:11 | 행:33]: 기초회로실험
# [W:34], [index 열:22 | 행:33]: 3
# [Y:34], [index 열:24 | 행:33]: B+
# [B:35], [index 열:1 | 행:34]: 2023
# [C:35], [index 열:2 | 행:34]: 2학기
# [E:35], [index 열:4 | 행:34]: 기초
# [G:35], [index 열:6 | 행:34]: BKSA58133
# [L:35], [index 열:11 | 행:34]: 대학기초물리학
# [W:35], [index 열:22 | 행:34]: 3
# [Y:35], [index 열:24 | 행:34]: B
# [B:36], [index 열:1 | 행:35]: 2023
# [C:36], [index 열:2 | 행:35]: 2학기
# [E:36], [index 열:4 | 행:35]: 기초
# [G:36], [index 열:6 | 행:35]: BKSA51431
# [L:36], [index 열:11 | 행:35]: 프랑스어기초
# [W:36], [index 열:22 | 행:35]: 3
# [Y:36], [index 열:24 | 행:35]: B
# [B:37], [index 열:1 | 행:36]: 2023
# [C:37], [index 열:2 | 행:36]: 2학기
# [E:37], [index 열:4 | 행:36]: 심화
# [G:37], [index 열:6 | 행:36]: BKSA58152
# [L:37], [index 열:11 | 행:36]: 글쓰기심화
# [W:37], [index 열:22 | 행:36]: 2
# [Y:37], [index 열:24 | 행:36]: B+
# [B:38], [index 열:1 | 행:37]: 2023
# [C:38], [index 열:2 | 행:37]: 2학기
# [E:38], [index 열:4 | 행:37]: 심화
# [G:38], [index 열:6 | 행:37]: BKSA59503
# [L:38], [index 열:11 | 행:37]: 확률과게임이론
# [W:38], [index 열:22 | 행:37]: 2
# [Y:38], [index 열:24 | 행:37]: B+
# [B:40], [index 열:1 | 행:39]: 2023
# [C:40], [index 열:2 | 행:39]: 동계 계절학기
# [E:40], [index 열:4 | 행:39]: 심화
# [G:40], [index 열:6 | 행:39]: BKSA64602
# [L:40], [index 열:11 | 행:39]: 삶을치유하는음악
# [W:40], [index 열:22 | 행:39]: 2
# [Y:40], [index 열:24 | 행:39]: B+
# [B:41], [index 열:1 | 행:40]: 2023
# [C:41], [index 열:2 | 행:40]: 동계 계절학기
# [E:41], [index 열:4 | 행:40]: 소양
# [G:41], [index 열:6 | 행:40]: BKSA62517
# [L:41], [index 열:11 | 행:40]: MOS활용
# [W:41], [index 열:22 | 행:40]: 2
# [Y:41], [index 열:24 | 행:40]: B+
# [B:42], [index 열:1 | 행:41]: 2023
# [C:42], [index 열:2 | 행:41]: 동계 계절학기
# [E:42], [index 열:4 | 행:41]: 소양
# [G:42], [index 열:6 | 행:41]: BKSA59472
# [L:42], [index 열:11 | 행:41]: 취업전략수립및역량개발1
# [W:42], [index 열:22 | 행:41]: 2
# [Y:42], [index 열:24 | 행:41]: P
# [B:44], [index 열:1 | 행:43]: 2024
# [C:44], [index 열:2 | 행:43]: 1학기
# [E:44], [index 열:4 | 행:43]: 전필
# [G:44], [index 열:6 | 행:43]: NDGE05021
# [L:44], [index 열:11 | 행:43]: 컴퓨터공학개론
# [W:44], [index 열:22 | 행:43]: 3
# [Y:44], [index 열:24 | 행:43]: B+
# [B:45], [index 열:1 | 행:44]: 2024
# [C:45], [index 열:2 | 행:44]: 1학기
# [E:45], [index 열:4 | 행:44]: 전선
# [G:45], [index 열:6 | 행:44]: NDGE48003
# [L:45], [index 열:11 | 행:44]: Java프로그래밍1
# [W:45], [index 열:22 | 행:44]: 3
# [Y:45], [index 열:24 | 행:44]: A
# [B:46], [index 열:1 | 행:45]: 2024
# [C:46], [index 열:2 | 행:45]: 1학기
# [E:46], [index 열:4 | 행:45]: 전선
# [G:46], [index 열:6 | 행:45]: NDGE14465
# [L:46], [index 열:11 | 행:45]: UNIX시스템
# [W:46], [index 열:22 | 행:45]: 3
# [Y:46], [index 열:24 | 행:45]: B+
# [B:47], [index 열:1 | 행:46]: 2024
# [C:47], [index 열:2 | 행:46]: 1학기
# [E:47], [index 열:4 | 행:46]: 전선
# [G:47], [index 열:6 | 행:46]: NDGE14393
# [L:47], [index 열:11 | 행:46]: 디지털논리회로
# [W:47], [index 열:22 | 행:46]: 3
# [Y:47], [index 열:24 | 행:46]: C+
# [B:48], [index 열:1 | 행:47]: 2024
# [C:48], [index 열:2 | 행:47]: 1학기
# [E:48], [index 열:4 | 행:47]: 전선
# [G:48], [index 열:6 | 행:47]: NDGE11820
# [L:48], [index 열:11 | 행:47]: 웹프로그래밍
# [W:48], [index 열:22 | 행:47]: 3
# [Y:48], [index 열:24 | 행:47]: B
# [B:49], [index 열:1 | 행:48]: 2024
# [C:49], [index 열:2 | 행:48]: 1학기
# [E:49], [index 열:4 | 행:48]: 전선
# [G:49], [index 열:6 | 행:48]: NDGE14544
# [L:49], [index 열:11 | 행:48]: 전산통계
# [W:49], [index 열:22 | 행:48]: 3
# [Y:49], [index 열:24 | 행:48]: A+
# [B:50], [index 열:1 | 행:49]: 2024
# [C:50], [index 열:2 | 행:49]: 1학기
# [E:50], [index 열:4 | 행:49]: 소양
# [G:50], [index 열:6 | 행:49]: BKSA58114
# [L:50], [index 열:11 | 행:49]: MOS
# [W:50], [index 열:22 | 행:49]: 2
# [Y:50], [index 열:24 | 행:49]: P
# [B:52], [index 열:1 | 행:51]: 2024
# [C:52], [index 열:2 | 행:51]: 하계 계절학기
# [E:52], [index 열:4 | 행:51]: 인성
# [G:52], [index 열:6 | 행:51]: BKSA10922
# [L:52], [index 열:11 | 행:51]: 건학정신과대학생활
# [W:52], [index 열:22 | 행:51]: 2
# [Y:52], [index 열:24 | 행:51]: P
# [B:53], [index 열:1 | 행:52]: 2024
# [C:53], [index 열:2 | 행:52]: 하계 계절학기
# [E:53], [index 열:4 | 행:52]: 기초
# [G:53], [index 열:6 | 행:52]: BKSA56558
# [L:53], [index 열:11 | 행:52]: 컴퓨팅적사고
# [W:53], [index 열:22 | 행:52]: 3
# [Y:53], [index 열:24 | 행:52]: A+
# [B:55], [index 열:1 | 행:54]: 2024
# [C:55], [index 열:2 | 행:54]: 2학기
# [E:55], [index 열:4 | 행:54]: 전필
# [G:55], [index 열:6 | 행:54]: NDGE11863
# [L:55], [index 열:11 | 행:54]: 데이터베이스
# [W:55], [index 열:22 | 행:54]: 3
# [Y:55], [index 열:24 | 행:54]: A
# [B:56], [index 열:1 | 행:55]: 2024
# [C:56], [index 열:2 | 행:55]: 2학기
# [E:56], [index 열:4 | 행:55]: 전선
# [G:56], [index 열:6 | 행:55]: NDGE57369
# [L:56], [index 열:11 | 행:55]: C프로그래밍
# [W:56], [index 열:22 | 행:55]: 3
# [Y:56], [index 열:24 | 행:55]: A+
# [B:57], [index 열:1 | 행:56]: 2024
# [C:57], [index 열:2 | 행:56]: 2학기
# [E:57], [index 열:4 | 행:56]: 전선
# [G:57], [index 열:6 | 행:56]: NDGE48004
# [L:57], [index 열:11 | 행:56]: Java프로그래밍2
# [W:57], [index 열:22 | 행:56]: 3
# [Y:57], [index 열:24 | 행:56]: A
# [B:58], [index 열:1 | 행:57]: 2024
# [C:58], [index 열:2 | 행:57]: 2학기
# [E:58], [index 열:4 | 행:57]: 전선
# [G:58], [index 열:6 | 행:57]: NDGE50346
# [L:58], [index 열:11 | 행:57]: 고급웹프로그래밍
# [W:58], [index 열:22 | 행:57]: 3
# [Y:58], [index 열:24 | 행:57]: B
# [B:59], [index 열:1 | 행:58]: 2024
# [C:59], [index 열:2 | 행:58]: 2학기
# [E:59], [index 열:4 | 행:58]: 전선
# [G:59], [index 열:6 | 행:58]: NDGE54361
# [L:59], [index 열:11 | 행:58]: 데이터과학
# [W:59], [index 열:22 | 행:58]: 3
# [Y:59], [index 열:24 | 행:58]: A
# [B:60], [index 열:1 | 행:59]: 2024
# [C:60], [index 열:2 | 행:59]: 2학기
# [E:60], [index 열:4 | 행:59]: 전선
# [G:60], [index 열:6 | 행:59]: NDGE50341
# [L:60], [index 열:11 | 행:59]: 창의공학설계
# [W:60], [index 열:22 | 행:59]: 3
# [Y:60], [index 열:24 | 행:59]: A
# [B:62], [index 열:1 | 행:61]: 2025
# [C:62], [index 열:2 | 행:61]: 1학기
# [E:62], [index 열:4 | 행:61]: 전필
# [G:62], [index 열:6 | 행:61]: NDGE12137
# [L:62], [index 열:11 | 행:61]: 운영체제
# [W:62], [index 열:22 | 행:61]: 3
# [Y:62], [index 열:24 | 행:61]: A
# [B:63], [index 열:1 | 행:62]: 2025
# [C:63], [index 열:2 | 행:62]: 1학기
# [E:63], [index 열:4 | 행:62]: 전선
# [G:63], [index 열:6 | 행:62]: NDGE59586
# [L:63], [index 열:11 | 행:62]: Swift프로그래밍
# [W:63], [index 열:22 | 행:62]: 3
# [Y:63], [index 열:24 | 행:62]: A
# [B:64], [index 열:1 | 행:63]: 2025
# [C:64], [index 열:2 | 행:63]: 1학기
# [E:64], [index 열:4 | 행:63]: 전선
# [G:64], [index 열:6 | 행:63]: NDGE56030
# [L:64], [index 열:11 | 행:63]: 소프트웨어종합설계
# [W:64], [index 열:22 | 행:63]: 3
# [Y:64], [index 열:24 | 행:63]: A+
# [B:65], [index 열:1 | 행:64]: 2025
# [C:65], [index 열:2 | 행:64]: 1학기
# [E:65], [index 열:4 | 행:64]: 전선
# [G:65], [index 열:6 | 행:64]: NDGE05022
# [L:65], [index 열:11 | 행:64]: 컴퓨터시스템
# [W:65], [index 열:22 | 행:64]: 3
# [Y:65], [index 열:24 | 행:64]: C
# [AG:65], [index 열:32 | 행:64]: 취득학점포기
# [B:66], [index 열:1 | 행:65]: 2025
# [C:66], [index 열:2 | 행:65]: 1학기
# [E:66], [index 열:4 | 행:65]: 전선
# [G:66], [index 열:6 | 행:65]: NDGE14448
# [L:66], [index 열:11 | 행:65]: 컴퓨터알고리즘
# [W:66], [index 열:22 | 행:65]: 3
# [Y:66], [index 열:24 | 행:65]: A
# [B:67], [index 열:1 | 행:66]: 2025
# [C:67], [index 열:2 | 행:66]: 1학기
# [E:67], [index 열:4 | 행:66]: 전선
# [G:67], [index 열:6 | 행:66]: NDGE21122
# [L:67], [index 열:11 | 행:66]: 프로그래밍실습
# [W:67], [index 열:22 | 행:66]: 3
# [Y:67], [index 열:24 | 행:66]: B+
# [B:68], [index 열:1 | 행:67]: 2025
# [C:68], [index 열:2 | 행:67]: 1학기
# [E:68], [index 열:4 | 행:67]: 소양
# [G:68], [index 열:6 | 행:67]: BKSA59479
# [L:68], [index 열:11 | 행:67]: 감성합창
# [W:68], [index 열:22 | 행:67]: 2
# [Y:68], [index 열:24 | 행:67]: P
# [B:70], [index 열:1 | 행:69]: 2025
# [C:70], [index 열:2 | 행:69]: 2학기
# [E:70], [index 열:4 | 행:69]: 전필
# [G:70], [index 열:6 | 행:69]: NDGE15060
# [L:70], [index 열:11 | 행:69]: 자료구조
# [W:70], [index 열:22 | 행:69]: 3
# [Y:70], [index 열:24 | 행:69]: A+
# [B:71], [index 열:1 | 행:70]: 2025
# [C:71], [index 열:2 | 행:70]: 2학기
# [E:71], [index 열:4 | 행:70]: 전필
# [G:71], [index 열:6 | 행:70]: NDGE12263
# [L:71], [index 열:11 | 행:70]: 컴퓨터구조
# [W:71], [index 열:22 | 행:70]: 3
# [Y:71], [index 열:24 | 행:70]: B+
# [B:72], [index 열:1 | 행:71]: 2025
# [C:72], [index 열:2 | 행:71]: 2학기
# [E:72], [index 열:4 | 행:71]: 전선
# [G:72], [index 열:6 | 행:71]: NDGE56032
# [L:72], [index 열:11 | 행:71]: 빅데이터기초
# [W:72], [index 열:22 | 행:71]: 3
# [Y:72], [index 열:24 | 행:71]: B+
# [B:73], [index 열:1 | 행:72]: 2025
# [C:73], [index 열:2 | 행:72]: 2학기
# [E:73], [index 열:4 | 행:72]: 전선
# [G:73], [index 열:6 | 행:72]: NDGE14419
# [L:73], [index 열:11 | 행:72]: 이산수학
# [W:73], [index 열:22 | 행:72]: 3
# [Y:73], [index 열:24 | 행:72]: B+
# [B:74], [index 열:1 | 행:73]: 2025
# [C:74], [index 열:2 | 행:73]: 2학기
# [E:74], [index 열:4 | 행:73]: 전선
# [G:74], [index 열:6 | 행:73]: NDGE62731
# [L:74], [index 열:11 | 행:73]: 클라우드컴퓨팅
# [W:74], [index 열:22 | 행:73]: 3
# [Y:74], [index 열:24 | 행:73]: B+
# [B:75], [index 열:1 | 행:74]: 2025
# [C:75], [index 열:2 | 행:74]: 2학기
# [E:75], [index 열:4 | 행:74]: 전선
# [G:75], [index 열:6 | 행:74]: NDGE56031
# [L:75], [index 열:11 | 행:74]: 프로젝트종합설계
# [W:75], [index 열:22 | 행:74]: 3
# [Y:75], [index 열:24 | 행:74]: A+
# [B:82], [index 열:1 | 행:81]: 2026-03-20 오후 2:54:40
